OpenFOAM/Jet FLow/SingleJet_Low Re/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;



boundaryField
{



top
    {
    	type           zeroGradient ;
     //   type            cyclic;
    }
    
    bottom
    {
        type           zeroGradient ;
     //   type            cyclic;
    }
    
    
    
    right
    {
  //  type            zeroGradient;
    
        type            fixedValue;
        value          uniform 0;  
    }
    left
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
 



}


// ************************************************************************* //
