OpenFOAM/Jet FLow/SingleJet_Low Re/system/parameters

x_min  0;
x_max  30 ; 
y_min  -5 ; 
y_max  5  ; 
z_min   -0.1 ;  
z_max 0.1;

nozzel_h   1;
U0    1 ;


Grid_x   300 ;
Grid_y 100 ;


nu    0.0001;





