OpenFOAM/Jet FLow/SingleJet_Low Re/system/vorticity
  vorticityFunction
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
      //  patches         (wall);
    }
    
    
    
